let handler = m => m; 
  
 handler.all = async function (m) { 
   let chat = global.db.data.chats[m.chat]; 
   let responses; 
   if (/^كت$/i.test(m.text)) { 
     responses = [ 
                    `*∞──────「كـت」──────∞*

*『مادة دايم تجيب العيد فيها ؟』*

*∞──────「🏮」──────∞*`,  
                      `*∞──────「🏮」──────∞*

*『كلمة بـ لهجتك تحس م احد بيعرفها ؟』*

*∞──────「🏮」──────∞*`,  
                         `*∞──────「🏮」──────∞*

*『اكثر شخص تتهاوش معه ؟』*

*∞──────「🏮」──────∞*`,  
                       `*∞──────「🏮」──────∞*

*『اكتب شطر من اغنية او قصيدة جا فـ بالك ؟』*

*∞──────「🏮」──────∞*`,  
                                    `*∞──────「🏮」──────∞*

*『أكثر شيء مضيع وقتك فيه ؟』*

*∞──────「🏮」──────∞*`,  
                                      `*∞──────「🏮」──────∞*

*『صوت مغني م تحبه ؟』*

*∞──────「🏮」──────∞*`,
                                      `*∞──────「🏮」──────∞*

*『شخصية تقهرك ؟』*

*∞──────「🏮」──────∞*`,
                                       `*∞──────「🏮」──────∞*

*『كم مره تشحن جوالك باليوم ؟』*

*∞──────「🏮」──────∞*`,
                                        `*∞──────「🏮」──────∞*

*『اخر مطعم اكلت منه ؟』*

*∞──────「🏮」──────∞*`,
                                         `*∞──────「🏮」──────∞*

*『بالعادة برمضان تنحف ولاتسمن ؟』*

*∞──────「🏮」──────∞*`,
                                          `*∞──────「🏮」──────∞*

*『أجمل صورة بجوالك ؟』*

*∞──────「🏮」──────∞*`,
                                          `*∞──────「🏮」──────∞*

*『اشياء تغيرت نظرتك لها』*

*∞──────「🏮」──────∞*`,
                                           `*∞──────「🏮」──────∞*

*『اخر كلمة تقولها لو خلصت كلامك ؟』*

*∞──────「🏮」──────∞*`,
                                     `*∞──────「🏮」──────∞*

*『صفة تخليك تكره الشخص مهما كان قربه منك ؟』*

*∞──────「🏮」──────∞*`,
                                            `*∞──────「🏮」──────∞*

*『اهم شيء يكون معك في كل طلعاتك ؟』*

*∞──────「🏮」──────∞*`,

                                           `*∞──────「🏮」──────∞*

*『مقولة او حكمة تمشي عليها ؟』*

*∞──────「🏮」──────∞*`,
                                     `*∞──────「🏮」──────∞*

*『مادة تكرها بس درجاتك عالية فيها ؟』*

*∞──────「🏮」──────∞*`,
                                            `*∞──────「🏮」──────∞*

*『دعاء له اثر إبجابي في حياتك ؟』*

*∞──────「🏮」──────∞*`,
                                            `*∞──────「🏮」──────∞*

*『كيف تعبر عن عصبيتك ؟』*

*∞──────「🏮」──────∞*`,
                            `*∞──────「🏮」──────∞*

*『كيف الجو عندكم اليوم ؟』*

*∞──────「🏮」──────∞*`,  
                            `*∞──────「🏮」──────∞*

*『اخر شخص قالك كلمة حلوة ..』*

*∞──────「🏮」──────∞*`,  
                               `*∞──────「🏮」──────∞*

*『اكتب اول كلمة جات في بالك الحين ؟』*

*∞──────「🏮」──────∞*`,  
                                  `*∞──────「🏮」──────∞*

*『اغنية ناشبه في مخك ؟』*

*∞──────「🏮」──────∞*`,  
                               `*∞──────「🏮」──────∞*

*『أصعب انتظار ؟』*

*∞──────「🏮」──────∞*`,  
                                    `*∞──────「🏮」──────∞*

*『أكثر شي يعتمدون عليك فيه ؟』*

*∞──────「🏮」──────∞*`,  
                                      `*∞──────「🏮」──────∞*

*『مشهور ، او مشهورة .. يشبهونك فيه』*

*∞──────「🏮」──────∞*`,
                                      `*∞──────「🏮」──────∞*

*『من الاشياء الي تجيب لك الصداع ؟』*

*∞──────「🏮」──────∞*`,
                                       `*∞──────「🏮」──────∞*

*『متى تحب الطلعة ؟』*

*∞──────「🏮」──────∞*`,
                                        `*∞──────「🏮」──────∞*

*『شخص مستحيل تمسك ضحكتك معاه؟』*

*∞──────「🏮」──────∞*`,
                                         `*∞──────「🏮」──────∞*

*『شعور ودك يموت ؟』*

*∞──────「🏮」──────∞*`,
                                          `*∞──────「🏮」──────∞*

*『أطول صداقة بينك وبين شخص كم مدتها ؟』*

*∞──────「🏮」──────∞*`,
                                          `*∞──────「🏮」──────∞*

*『سويت شيء بالحياة وانت مو مقتنع فيه ؟』*

*∞──────「🏮」──────∞*`,
                                           `*∞──────「🏮」──────∞*

*『اسم تحس صاحبه فخم ؟』*

*∞──────「🏮」──────∞*`,
                                     `*∞──────「🏮」──────∞*

*『منشن .. شخص تقوله اشتقت لك ؟』*

*∞──────「🏮」──────∞*`,
                                            `*∞──────「🏮」──────∞*

*『مرة سويت جميل و نكره شخص ؟』*

*∞──────「🏮」──────∞*`,

                                           `*∞──────「🏮」──────∞*

*『تقدر تعيش يوم كامل بدون نت ؟』*

*∞──────「🏮」──────∞*`,
                                     `*∞──────「🏮」──────∞*

*『فن تحبه كثير ؟』*

*∞──────「🏮」──────∞*`,
                                            `*∞──────「🏮」──────∞*

*『مع او ضد : العتاب على قدر المحبة ؟』*

*∞──────「🏮」──────∞*`,
                                            `*∞──────「🏮」──────∞*

*『ردك على من يدور الزعل ؟』*

*∞──────「🏮」──────∞*`

     ];
    }  
   if (responses) { 
     let randomIndex = Math.floor(Math.random() * responses.length); 
     conn.reply(m.chat, responses[randomIndex], m); 
   } 
   return !0 
 }; 
  
 export default handler;
